/*------------------------------------------------------------------------*/
//1.push()
var arr1 = [1,2,3,4];
arr1.push(5,6); //可以一次添加多个参数，如果没有参数，则不会改变原数组
console.log(arr1); //[1,2,3,4,5,6]

/*------------------------------------------------------------------------*/
//2.pop()方法用于删除并返回数组的最后一个元素。如果数组已空，则会返回undefined
var arr2 = [2,3,4,5];
arr2.pop(); //传参并没有用
console.log(arr2); //[2,3,4]

/*------------------------------------------------------------------------*/
//3.unshift()
var arr3 = [3,4,5,6];
arr3.unshift(7,8); //可以一次添加多个参数，如果没有参数，则不会改变原数组
console.log(arr3); //[7,8,3,4,5,6]

/*------------------------------------------------------------------------*/
//4.shift()
var arr4 = [4,5,6,7];
arr4.shift(); //传参并没有用
console.log(arr4); //[5,6,7]

/*------------------------------------------------------------------------*/
//5.slice() 方法返回一个从开始到结束（不包括结束）选择的数组的一部分浅拷贝到一个新数组对象。且原始数组不会被修改。
var arr5 = [5,6,7,8,9];
var result1 = arr5.slice(1,3); //result1 [6,7]
var result2 = arr5.slice(2); //result2 [7,8,9]
var result3 = arr5.slice(-3, -2); //result3 [7]
var result4 = arr5.slice(-3); //result3 [7,8,9]


/*------------------------------------------------------------------------*/
//6.splice() arrayObject.splice(index,howmany,item1,.....,itemX)方法向/从数组中添加/删除项目，然后返回被删除的项目。
var arr6 = [6,7,8,9];
arr6.splice(1,1,10,11,12);
console.log(arr6); //[6,10,11,12,8,9]
arr6.splice(-3,2);
console.log(arr6); //[6,10,11,9]


/*------------------------------------------------------------------------*/
//7.fill() arr.fill(value, start, end)(不包括结束)
var arr7 = [7,8,9,10,11]
arr7.fill(3, 1, 3);
console.log(arr7); //[7,3,3,10,11]
arr7.fill(5,2);
console.log(arr7); //[7,3,5,5,5]
arr7.fill()





/*------------------------------------------------------------------------*/
//9.push()


