//1.for循环
var arr1 = [1,2,3,4];
for (var i = 0, len = arr1.length; i < len; i++) {
  console.log(arr1[i]); //1 2 3 4
}

/*------------------------------------------------------------------------------------------------*/
//2.forEach()
var arr2 = [2,3,4,5];
arr2.forEach(function(item) {
  console.log(item); //2 3 4 5
});
//对于类数组对象，比如NodeList，可以使用下面的方法来遍历
var arr3 = [3,4,5,6];
Array.prototype.forEach.call(arr3, function(el) {
  console.log(el); //3 4 5 6
});

/*------------------------------------------------------------------------------------------------*/
//3.for..in
var arr4 = [4,5,6,7];
for (var i in arr4) {
  console.log(arr4[i]); //4 5 6 7
}

/*------------------------------------------------------------------------------------------------*/
//4.for..of
var arr5 = [5,6,7,8];
for (let i of arr5) {
  console.log(i); //5 6 7 8
}

/*------------------------------------------------------------------------------------------------*/
//5.map
var arr6 = [6,7,8,9];
arr6.map(function(item) {
  console.log(item); //6 7 8 9
});

/*------------------------------------------------------------------------------------------------*/
//6.every 方法测试数组的所有元素是否都通过了指定函数的测试。
var arr7 = [7,8,9,10];
var result = arr7.every(function(currentValue) {
  return currentValue < 10;
})
console.log(result); //false

/*------------------------------------------------------------------------------------------------*/
//6.filter() 方法创建一个新的数组，新数组中的元素是通过检查指定数组中符合条件的所有元素。
var arr8 = [8,9,10,11];
var result = arr8.filter(function(age) {
  return age > 9;
});
console.log(result); //[10,11]




